### Connect to MariaDB

- Open `XAMPP Control Panel` application, start `MySQL` and `Apache` modules.

- Say, MySQL starts at port 3306.

- Click on `Admin` button near MySQL module, it takes you to `PHPMyAdmin`.

- Store database username, password, port in `.env` file and load them.

- Install the following Python packages:

    - `sqlalchemy`, `pymysql`
    
- Connect to the DB using the below code.

&rarr; For other databases, refer the `sqlalchemy` documentation.

In [9]:
# connect to DB
import sqlalchemy as db
from dotenv import load_dotenv
import os

load_dotenv()

username, password = os.environ['mariadb_username'], os.environ['mariadb_password']
port = os.environ['mariadb_port']
engine = db.create_engine(f'mariadb+pymysql://{username}:{password}@localhost:{port}/python_pandas_db')

### `pd.read_sql_table(table_name, db_engine_var)`

- Reads table into dataframe.

- `columns` argument: list of columns to read from DB.

In [10]:
import pandas as pd

# read 'customers' table into a dataframe
df = pd.read_sql_table('customers', engine)
df

   id     name       phone
0   1  sheldon  4343434343
1   2   howard  1111111111
2   3  leonard  1313131313
3   4      raj  2222222222

In [11]:
# read only name
df = pd.read_sql_table('customers', engine, columns = ['name'])
df

      name
0  sheldon
1   howard
2  leonard
3      raj

### `pd.read_sql_query(sql_query_string, db_engine_var)`

- Executes the given query and returns the returns into a dataframe.

In [19]:
# names whose length is >= 7

query = 'SELECT * FROM customers WHERE LENGTH(name) >= 7'

df = pd.read_sql_query(query, engine)
df

   id     name       phone
0   1  sheldon  4343434343
1   3  leonard  1313131313

### `pd.read_sql(query | table_name, engine)`

- It is a wrapper aroung `read_sql_table` and `read_sql_query` methods.

In [20]:
# with table name
pd.read_sql('customers', engine)

   id     name       phone
0   1  sheldon  4343434343
1   2   howard  1111111111
2   3  leonard  1313131313
3   4      raj  2222222222

In [21]:
# with query
pd.read_sql(query, engine)

   id     name       phone
0   1  sheldon  4343434343
1   3  leonard  1313131313

### `df.to_sql(name=table_name, con=engine_var, index=False, if_exists='fail')`

- `to_sql` is used to write data from a dataframe into a DB table.

- `name` argument: specifies the table name.

- `con` argument: the engine/connection variable.

- `index` argument: (`True` by default) If True, writes the index column to DB (this is undesirable).

- `if_exists` argument: specifies what to do incase a record already exists in the DB.

    - `fail`
    
    - `append`
    
    - `replace`
    
- Returns the number of rows inserted.

- For example, consider the dataframe from a CSV file:

In [22]:
df = pd.read_csv('data/customers.csv')
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [23]:
# rename columsn as per requirement
df.rename(columns={
    'Customer Name': 'name',
    'Customer Phone': 'phone'
}, inplace=True)
df

              name       phone
0     rafael nadal  4567895647
1  maria sharapova   434534545
2   vladimir putin    89345345
3      kim un jong   123434456
4       jeff bezos   934534543
5     rahul gandhi    44324222

In [27]:
# insert into customers table
df.to_sql(
    name='customers',
    con=engine,
    index=False,
    if_exists='append'
)

6

In [28]:
# check the DB for new data
pd.read_sql('customers', engine)

   id             name       phone
0   1          sheldon  4343434343
1   2           howard  1111111111
2   3          leonard  1313131313
3   4              raj  2222222222
4   5     rafael nadal  4567895647
5   6  maria sharapova   434534545
6   7   vladimir putin    89345345
7   8      kim un jong   123434456
8   9       jeff bezos   934534543
9  10     rahul gandhi    44324222